const sisulLocation = [
    {
        city: '서울특별시',
        sub: [
            
        ]
    },

    {
        city: '경기도',
        sub: [
            {gu : '김포,파주,고양'},
            {gu : '부천,광명,시흥'},
            {gu : '과천,안양,성남'},
            {gu : '구리,하남,광주'},
            {gu : '의정부,양주,남양주'},
            {gu : '안산,군포,의왕'},
            {gu : '수원,화성,용인'},
            {gu : '오산,평택,안성'},
            {gu : '이천,여주'},
            {gu : '가평,양평'},
        ]
    },

    {
        city: '부산광역시',
        sub: [
            
        ]
    },

    {
        city: '대구광역시',
        sub: [
            
        ]
    },

    {
        city: '인천광역시',
        sub: [
            
        ]
    },

    {
        city: '광주광역시',
        sub: [
            
        ]
    },

    {
        city: '대전광역시',
        sub: [
            
        ]
    },
    {
        city: '울산광역시',
        sub: [
            
        ]
    },
    {
        city: '세종특별자치시',
        sub: [
            
        ]
    },

    {
        city: '강원도',
        sub: [
            
        ]
    },

    {
        city: '충청북도',
        sub: [
            
        ]
    },

    {
        city: '충청남도',
        sub: [
            
        ]
    },

    {
        city: '전라북도',
        sub: [
            
        ]
    },

    {
        city: '전라남도',
        sub: [
            
        ]
    },

    {
        city: '경상북도',
        sub: [
            
        ]
    },

    {
        city: '경상남도',
        sub: [
            
        ]
    },

    {
        city: '제주특별자치도',
        sub: [
            
        ]
    },



]